//======================================
//             «Поверхностное расформатирование всех стихов»
//      Скрипт предназначен для исправления одной редкой ошибки в файле FB2, при которой прозаический текст книги хаотично и бессистемно отформатирован как «стихи».
//      Для всех остальных файлов, скрипт может навредить.
//~~~~~~~~~~~~~~~~~~
// v.1.0 — Создание скрипта — Александр Ка (10.05.2024)
// v.1.1 — Исправлена ошибка с добавлением пустых строк — Александр Ка (10.06.2024)
// v.1.2 — Удаление лишних операций, изменение названия скрипта  — Александр Ка (17.06.2024)
// v.1.3 — Исключение из обработки стихов, внутри которых есть тег <text-author>   — Александр Ка (19.06.2024)
//~~~~~~~~~~~~~~~~~~


var NumerusVersion="1.3";

function Run() {

//--------------------------------------------------------------------
//--------------------------------------------------------------------
//--------------------------------------------------------------------



                 /// ОБЩИЕ ПЕРЕМЕННЫЕ


//  Счетчики цикла
var j = 0;
var n = 0;

//  Структура текста (аннотация + история + все <body>, иначе говоря, всё что видно в режиме "B"-дизайн)
 var fbwBody=document.getElementById("fbw_body");

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 /// ПРЕДУПРЕЖДЕНИЕ


 var otvet = false;

 otvet=AskYesNo("                                          <!>  ПРЕДУПРЕЖДЕНИЕ  <!>\n\n"+
                                   "              Скрипт предназначен для исправления одной редкой ошибки,\n"+
                                   "при которой текст книги хаотично и бессистемно отформатирован как «стихи».                \n\n"+
                                   "•    Для исправления этой ошибки, скрипт...\n"+
                                   "1.  добавляет пустые строки на стыке «строф» (<stanza>)\n"+
                                   "2.  удаляет почти всё форматирование «стих» (<poem>)\n"+
                                   "3.  удаляет почти всё форматирование «строфа» (<stanza>)\n"+
                                   "4.  изменяет почти все теги <v> на <p>\n\n"+
                                   "•    Всё прочее форматирование внутри «стиха» остается без изменений.\n\n"+
                                   "                                                       ПРОДОЛЖИТЬ ?");

 if (!otvet) return;

  var Ts1=new Date().getTime();
  var tempus=0;

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 /// СОЗДАНИЕ МАССИВА с разделами "poem"


 var mDiv=fbwBody.getElementsByTagName("DIV");  //  массив с узлами "DIV"
 var div;                //  один из узлов "DIV"

 var mPm=[];                 //  массив с узлами "poem"
 var count_Pm = 0;


 for (j=mDiv.length-1; j>=0; j--) {

         div = mDiv[j];

         // Создание массива с узлами "poem"
         if (div.className =="poem")
                 { mPm[count_Pm] = div;  count_Pm++ }

         }

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



    window.external.BeginUndoUnit(document,"«Поверхностное расформатирование всех стихов» v."+NumerusVersion);                               // ОТКАТ (UNDO) начало

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 /// ОБРАБОТКА ТЕКСТА  :  Разделы "poem"  :  операции № 101, 111, 112

 var pm;
 var mStnz=[];  //  массив с узлами "stanza"
 var stnz;
 var mPtr=[];  //  массив с узлами "P"

 var count_101=0;  var count_111=0;  var count_112=0;

aaa:
 for (j=count_Pm-1; j>=0; j--) {
         pm=mPm[j];

                 //  Исключение из обработки стихов, внутри которых есть тег <text-author>
         mPtr=pm.children;
         for (n=0; n<mPtr.length; n++)
                 { if (mPtr[n].className =="text-author")  continue aaa }

                 //  Добавление пустой строки между строфами   и   удаление форматирования строфой ("stanza")
         mStnz=pm.getElementsByTagName("DIV");
         for (n=mStnz.length-1; n>=0; n--) {
                 stnz=mStnz[n];
                 if (stnz.className !="stanza") continue;
                 if (stnz.previousSibling  &&  stnz.previousSibling.className =="stanza") {
                         stnz.insertAdjacentElement("beforeBegin",document.createElement("P"));
                         window.external.inflateBlock(stnz.previousSibling)=true;
                         count_101++ }
                 stnz.removeNode(false);
                 count_111++;
                 }

                 //  Удаление форматирования стихами ("poem")
         pm.removeNode(false);
         count_112++;

         }

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------


    window.external.EndUndoUnit(document);                                             // undo конец (запись в систему для отката)

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 /// ОКНО РЕЗУЛЬТАТОВ  :  Текущее время и дата


 var currentFullDate = new Date();

 var currentHours = currentFullDate.getHours();
 var currentMinutes = currentFullDate.getMinutes();
 var currentSeconds = currentFullDate.getSeconds();

 if (currentMinutes<10) currentMinutes = "0" + currentMinutes;
 if (currentSeconds<10) currentSeconds = "0" + currentSeconds;

 var currentDay = currentFullDate.getDate();
 var currentMonth = 1+currentFullDate.getMonth();
 var currentYear = currentFullDate.getFullYear();

 if (currentDay<10) currentDay = "‌ ‌ " + currentDay;
 if (currentMonth<10) currentMonth = "0" + currentMonth;
 currentYear = (currentYear+"").replace(/^.*?(\d{1,2})$/g, "$1");

 var currentTime = currentHours + ":" + currentMinutes + ":" + currentSeconds;
 var currentDate = currentDay + "." + currentMonth + "." + currentYear;

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 /// ОКНО РЕЗУЛЬТАТОВ  :  Подсчет чистого компьютерного времени, потраченного на обработку текста


 var Tf1=new Date().getTime();

 var T2=(Tf1-Ts1);
 var Tmin  = Math.floor((T2)/60000);
 var TsecD = ((T2)%60000)/1000;
 var Tsec = Math.floor(TsecD);

 if (Tmin ==0)
         tempus = (TsecD+"").replace(/(.{1,5}).*/g, "$1").replace(".", ",")+" сек";
     else {
             tempus = Tmin+" мин";
             if (Tsec !=0)
                     tempus += " " + Tsec+ " с" }

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 // Подсчет общего количества исправлений
 var itogi = count_101+count_111+count_112;



                 /// ДОПОЛНЕНИЕ  :  Демонстрационный режим "Показать все строки"


 var dem=false;
// dem=true;   // !!!!!  активатор
 if (dem) {
         var Z="н/д";
         itogi=Z;  count_101=Z;  count_111=Z;  count_112=Z;
        }

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 /// ОКНО РЕЗУЛЬТАТОВ  :  Сборка массива с результатами обработки


 var mSt=[];
 var ind=1;

                                                             mSt[ind]='• СТАТИСТИКА:';  ind++;
                                                             mSt[ind]='• Время выполнения   .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .	'+tempus;  ind++;
                                                             mSt[ind]='• Всего исправлений   .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .  .	'+itogi;  ind++;

 var cTaT1=ind-1;  //  число строк в первом разделе

                                                             mSt[ind]='';  ind++;
                                                             mSt[ind]='• ИСПРАВЛЕНИЯ:';  ind++;

         if (count_101!=0)             { mSt[ind]='101. Добавление пустых строк на стыке строф  .  .  .  .  .  .  .  .  .  .  .  .	'+count_101;  ind++ }
         if (count_111!=0)             { mSt[ind]='111. Удаление форматирования строф ("stanza")   .  .  .  .  .  .  .  .  .  .  .	'+count_111;  ind++ }
         if (count_112!=0)             { mSt[ind]='112. Удаление форматирования стихами ("poem")  .  .  .  .  .  .  .  .  .  .  .	'+count_112;  ind++ }

 if (cTaT1==ind-3) ind=ind-2;  //  Удаление двух последних строк, если нет пунктов в этом разделе


//  Сборка строк текущей даты и времени
                                                             mSt[ind]='				';  ind++;
                                                             mSt[ind]="  ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ "+currentDate+" ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ "+currentTime+" ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ‌ ";  ind++;

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



                 /// ОКНО РЕЗУЛЬТАТОВ  :  Вывод окна результатов на экран


 var st2="";  //  текст результатов

 for  ( j=1; j!=ind; j++ )
        st2=st2+'\n     '+mSt[j];  //  добавление элемента из массива


//  Вывод окна результатов
 MsgBox ('                   .·.·.·.                                   –= ◊ =–                                  .·.·.·.\n'+
                   '                ·.̉·.̉·.̉  «Поверхностное расформатирование всех стихов» v.'+NumerusVersion+'  .̉·.̉·.̉·                                  \n'+
                   '                    ̉   ̉   ̉                                                                                         ̉   ̉   ̉ '+st2);

// ---------------------------------------------------------------
// ----------------------------------------------
// -----------------------------



}







