//======================================
//             «Генеральная уборка» (версия 2.6)
//                                             Engine by ©Sclex
//                                                    01.05.2007 – 31.08.2022
//~~~~~~~~~~~~~~~~~~
// v.1.01 — курсивное лидирующее тире в диалогах №08 — Faiber
//~~~~~~~~~~~~~~~~~~
// v.1.02 — курсив в списках №50
//~~~~~~~~~~~~~~~~~~
// v.1.03 — тире за препинаниями после скобки №13
//~~~~~~~~~~~~~~~~~~
// v.1.04 — открывающие кавычки перед лидирующим тире в диалогах №08
//              запрещение вставки пробела после точки, если после следующей буквы стоит точка №31
//              пробел перед % после цифр №53
//              неразрывный после № и § перед цифрами №54
//              оставил в покое многоточие №05
//              лидирующая тильда ушла в №08
//              тире после запятой, перед которой точка №13
//              начальные и конечные пробелы абзаца в курсиве №81, 82
//~~~~~~~~~~~~~~~~~~
// v.1.05 — тотальная замена коротких тире на длинные №07 — Faiber
//              две точки после слова в одноточие №38
//              в сносках не только цифры в квадратных скобках, а ваще всё что угодно
//~~~~~~~~~~~~~~~~~~
// v.1.06 — замена конечных дефисов на тире производится только в стихах №19 — Faiber
//              удаление лишних точек в заголовках №84
//              счётчики статистики
//              примитивная унификация сносок №40 — Faiber
//              дефис после точки не меняется на тире №13
//~~~~~~~~~~~~~~~~~~
// v.1.07 — вынос сноски за многоточие в конце строки №46
//~~~~~~~~~~~~~~~~~~
// v.1.08 — тире вместо дефиса после точки перед Прописной №29 — Faiber
//               препинания после сноски — везде № 46
//~~~~~~~~~~~~~~~~~~
// v.1.09 — удаление лишних ID №90
//~~~~~~~~~~~~~~~~~~
// v.1.10 — отдельный шаблон для тире после препинаний №55
//~~~~~~~~~~~~~~~~~~
// v.1.11 — немного дополнительной статистики
//               укороченное тире в интервалах дат №52, 60–63, 67
//~~~~~~~~~~~~~~~~~~
// v.1.12 — пропущенные пробелы после препинаний №85
//~~~~~~~~~~~~~~~~~~
// v.1.13 — дефис на тире ещё и в курсиве №29
//~~~~~~~~~~~~~~~~~~
// v.1.14 — стык эмфазиса через тире и пр. №56
//~~~~~~~~~~~~~~~~~~
// v.1.16 — тире вместо дефиса после точки перед открывающимися угловыми кавычками №57
//               пробел после букв-пробел-тире  №58
//~~~~~~~~~~~~~~~~~~
// v.1.17 — неверный знак препинания !… -> !.. №86
//               тире после «!..»  №14а — Faiber
//~~~~~~~~~~~~~~~~~~
// v.1.18 — пробел после тире №55a — Faiber
//~~~~~~~~~~~~~~~~~~
// v.1.19 — более жёстко заданы номера сносок без < и > №41…49
//               сноска зашагивает за многоточие только в конце абзаца — №46a
//~~~~~~~~~~~~~~~~~~
// v.1.20 — пробел перед тире после двоеточия и закр. кавычек №26
//~~~~~~~~~~~~~~~~~~
// v.1.21 — пробел перед тире после вопроса\восклицания и двоеточия №13а
//~~~~~~~~~~~~~~~~~~
// v.1.27 — пробел после букв+двоеточия перед кавычками ["] №27
//               пробел после точки перед откр. кавычками [«] №34
//~~~~~~~~~~~~~~~~~~
// v.1.28 — пронумерованный список: статьи Ст. 1… №50a
//~~~~~~~~~~~~~~~~~~
// v.1.29 — удаление неразрывного пробела после тире №01
//~~~~~~~~~~~~~~~~~~
// v.1.30 — мультипрепинания за сноской №46
//~~~~~~~~~~~~~~~~~~
// v.1.31 — уточнил градусы Цельсия №67
//
// вопрос по обычным двойным кавычкам в №№27, 32
//~~~~~~~~~~~~~~~~~~
// v.1.33 — опять. - дефис после препинаний №29, 31
//~~~~~~~~~~~~~~~~~~
// v.1.34 — emphasis'ы со strong'ами загнал в переменные
//~~~~~~~~~~~~~~~~~~
// v.1.35 — #84 попытка оставить на месте точки в заголовках, типа 1980 г.; XXI в.; Буш-мл. и т.п.
//~~~~~~~~~~~~~~~~~~
// v.1.36 — ##40,46,46a + PromtSnoska – возможность отключениия простановки квадратных скобок вокруг сноски
//~~~~~~~~~~~~~~~~~~
//v.2.0 — изменения для правильной работы с учетом возможности выбора вида неразрывного пробела в FBE
//======================================
//v.2.1 — отключил «окавычивание» №15,17, 18, 37, 38 — для этого есть скрипты по кавычкам; перестал обращать внимание на сноски 40, 41, 43, 47 — есть скрипты по сноскам
//======================================
//v.2.2 — убрал Ко
//======================================
//v.2.3 — унификация апострофов, замена-удаление различных мусорных знаков: U+202B, U+00AD, U+E088, пробелы U+0020, U+2002, U+200B, U+202F, U+2009, U+200A, прилипшие многоточия и проч. (п.п. 92-141) — TaKir
//======================================
//v.2.4 — теперь, если заголовок заканчивается на вопросительное или восклицательное многоточие ("?..", "!..", "?!.") , то скрипт не будет отрывать от него конечную точку.
//Примеры заголовков, которые раньше обрабатывались неверно: "СССР: вернуться в детство?..", "Ты кто?!."
//======================================
//v.2.5 — регэкспы (п.п. 142-149) — TaKir

//======================================
var VersionNumber="2.6";

//обрабатывать ли history
var ObrabotkaHistory=true;
//обрабатывать ли annotation
var ObrabotkaAnnotation=true;
// обрабатывать ли сноски                       // отключаю касательство к сноскам
// var Snoska=false;
//  var PromptSnoska=true;

var sIB="<EM>|<STRONG>|<EM><STRONG>|<STRONG><EM>";
var fIB="</EM>|</STRONG>|</EM></STRONG>|</STRONG></EM>";
var aIB="<EM>|<STRONG>|<EM><STRONG>|<STRONG><EM>|</EM>|</STRONG>|</EM></STRONG>|</STRONG></EM>";

function Run() {

 try { var nbspChar=window.external.GetNBSP(); var nbspEntity; if (nbspChar.charCodeAt(0)==160) nbspEntity="&nbsp;"; else nbspEntity=nbspChar;}
 catch(e) { var nbspChar=String.fromCharCode(160); var nbspEntity="&nbsp;";}

// if (PromptSnoska) {                                                                     // отключаю касательство к сноскам
//  Snoska=AskYesNo("    	      –=Jürgen Script=–\n\n	Обращать внимание [на] сноски?  		   \n");
// }

  var Ts=new Date().getTime();
  var TimeStr=0;

//~~~~~~~~~~ Регулярные выражения ~~~~~~~~~~~~

// замена неразрывных пробелов на обычные
 var re01 = new RegExp("([А-Яа-яa-zё—]("+aIB+"){0,1}[\\\?!\\\.,:]{0,1})"+nbspEntity+"(("+sIB+"){0,1}[а-яa-zё])([^\\\.])","g");
 var re01_ = "$1 $3$5";
 var count_01 = 0;

// удаление точки между строчными после пробела, чтобы не цеплялись url'ы — латиница только до
 var re30 = new RegExp("([а-яё])\\\s\\\.([а-яё])","g");
 var re30_ = "$1 $2";
 var count_30 = 0;

// удаление непонятной оторванной точки
 var re02 = new RegExp("(\\\.|,) (\\\.)","gi");
 var re02_ = "$1 ";

// удаление лишнего пробела перед закрывающими кавычками, скобками и знаками препинания
 var re03 = new RegExp("(\\\s|"+nbspEntity+")([\\\.,\\\;\\\:!\\\?\\\)\\\]»])","g");
 var re03_ = "$2";
 var count_03 = 0;

// удаление лишнего пробела после открывающих кавычек и скобок
 var re04 = new RegExp("([«\\\(\\\[„])(\\\s|"+nbspEntity+")","gi");
 var re04_ = "$1";
 var count_04 = 0;

//  удаление пробела перед кавычкой после которой стоит знак препинания
 var re05 = new RegExp("([\\\w0-9А-яЁё!\\\?\\\+\\\.”])(\\\s|"+nbspEntity+")(\\\")([:;,\\\.\\\?!])","gi");
 var re05_ = "$1$3$4";

// замена троеточия и его производных (или знака, например, точка-точка-запятая, которого в русском языке не существует) на многоточие
// var re06 = new RegExp("(\\\.\\\.\\\.|,\\\.\\\.|\\\.,\\\.|\\\.\\\.,)","gi");
// var re06_ = "…";
// var count_06 = 0;

// короткие тире на длинные
 var re07 = new RegExp("([^0123456789])–([^0123456789])","gi");
 var re07_ = "$1—$2";

// лидирующее тире с неразрывным пробелом в диалогах; удаление случайного мусора после скана: точка в начале диалога
 var re08 = new RegExp("^("+sIB+"){0,1}([«\\\"]){0,1}[-–—~]{1,2}("+sIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}\\\.{0,1}("+sIB+"){0,1}([\\\wА-яЁё«\\\"„\\\(\\\?!…])","gi");
 var re08_ = "$1$2—"+nbspChar+"$3$5$6";
 var count_08 = 0;

// нормализация одиночных курсивных знаков препинания
 var re09 = new RegExp("("+sIB+")([\\\s,\\\.\\\-–—;!\\\?:/~])(\\\s|"+nbspEntity+"){0,1}("+fIB+")","gi");
 var re09_ = "$2$3";
 var count_09 = 0;

// денормализация одиночных знаков препинания
 var re09a = new RegExp("("+sIB+")((\\\s|"+nbspEntity+"){0,1}[\\\s\\\-–—](\\\s|"+nbspEntity+"){0,1})("+fIB+")","gi");
 var re09a_ = "$2";
 var count_09 = 0;

// удаление стыков эмфазиса и стронга
 var re10 = new RegExp("</EM>(\\\s|"+nbspEntity+"){0,1}<EM>|</STRONG>(\\\s|"+nbspEntity+"){0,1}<STRONG>","gi");
 var re10_ = "$1";
 var count_10 = 0;

// правильнописание сокращений типа "так далее" — т. д.
 var re11 = new RegExp("([^\\\.а-яё])([Тт])\\\.\\\s{0,1}([д|п|е|к|о|н|ч])\\\.","g");
 var re11_ = "$1$2."+nbspChar+"$3.";
 var count_11 = 0;

// правильнописание сокращений "новой эры" — н. э.
 var re12 = new RegExp("(н)\\\.\\\s{0,1}(э)\\\.","g");
 var re12_ = "$1."+nbspChar+"$2.";

// тире после препинаний
 var re13 = new RegExp("([a-zа-яё\\\"“»\\\)\\\? ])(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}([,!\\\?…])(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}-{1,2}("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+sIB+"){0,1}(.[^.])","gi");
 var re13_ = "$1$4$3$6"+nbspChar+"— $7$9$10";
 var count_13 = 0;

// тире после препинаний — (!..) и (?..)
 var re13a = new RegExp("([!\\\?]\\\.\\\.)("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}([\\\-–—]){1,2}("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}(.[^.])","gi");
 var re13a_ = "$1$2$5"+nbspChar+"— $7$8";

// тире после препинаний /!).-/
 var re13b = new RegExp("([!\\\?]\\\")("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}([\\\-–—]){1,2}("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}(.[^.])","gi");
 var re13b_ = "$1$2$5"+nbspChar+"— $7$8";


// тире после препинаний
 var re13c = new RegExp("([!\\\?\\\)])("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}([\\\-–—]){1,2}("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}([А-яё])","gi");
 var re13c_ = "$1$2$5"+nbspChar+"— $7$8";

// замена дефисов на тире не после препинаний
 var re14 = new RegExp("([^\\\.,!\\\?…])(\\\s|"+nbspEntity+")("+aIB+"){0,1}[-–]{1,2}(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}([^\\\d<])","gi");
 var re14_ = "$1$3 — $5$7";
 var count_14 = 0;

// замена дефисов на тире "A": после !..-, с пробелом или без
 var re14a = new RegExp("(!\\\.\\\.)("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}[-–]{1,2}("+aIB+"){0,1}("+sIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+sIB+"){0,1}([^\\\d<])","gi");
 var re14a_ = "$1$2$4 — $5$7$8";

// замена дефисов на тире "Б": после букв и точки, с пробелом
 var re14b = new RegExp("([а-яё])(\\\.)("+aIB+"){0,1}(\\\s|"+nbspEntity+")[-–]{1,2}("+aIB+"){0,1}("+sIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+sIB+"){0,1}([^\\\d<])","g");
 var re14b_ = "$1$2$3"+nbspChar+"— $5$6$8$9";


// замена дефисов на тире "В": после букв и точки перед буквой без точки
 var re14c = new RegExp("([а-яё])(\\\.)("+aIB+"){0,1}[-–]{1,2}("+aIB+"){0,1}("+sIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+sIB+"){0,1}([А-яЁё][^\\\.])","g");
 var re14c_ = "$1$2$3"+nbspChar+"— $4$5$7$8";

// кавычки одиночного символа или небольшого слова
// var re15 = new RegExp("(\\\s|"+nbspEntity+")\\\"(\\\s|"+nbspEntity+"){0,1}([\\\w0-9А-яЁё\\\-]{1,20})(\\\s|"+nbspEntity+"){0,1}\\\"([\\\.,:;\\\?!…]){0,1}(\\\s|"+nbspEntity+")","gi");
// var re15_ = "$1«$3»$5$6";

// дубли препинаний
 var re16 = new RegExp(",[\\\.,:;]","gi");
 var re16_ = ",";

// попытка вернуть кавычки на место, после пробела
// var re17 = new RegExp("\\\"([\\\w0-9А-яЁё\\\-]{1,20})([^:])(\\\s|"+nbspEntity+")\\\"(\\\s|"+nbspEntity+")","gi");
// var re17_ = "«$1$2»$4";

// замыкающие кавычки в конце строки после пробела
// var re18 = new RegExp("(\\\s|"+nbspEntity+")\\\"$","gi");
// var re18_ = "»";

// замена конечных дефисов на тире !!!Только в стихах!!!
 var re19 = new RegExp("(\\\s|"+nbspEntity+"){0,1}([\\\-–]){1,2}(\\\s|"+nbspEntity+"){0,1}(</((EM)|(STRONG))>){0,1}$","gi");
 var re19_ = nbspChar+"—$4";


// удаление сдвоенных тире
 var re20 = new RegExp("([\\\-–—])(\\\s|"+nbspEntity+"){0,1}([\\\-–—])","gi");
 var re20_ = "$1";

// удаление непонятной запятой после восклицания и вопроса
 var re21 = new RegExp("([!\\\?]),","gi");
 var re21_ = "$1";

// градусы с секундами и минутами  23°8'48"
 var re22 = new RegExp("([0-9]{1,2})°\\\s{0,1}([0-9]{1,2})'\\\s{0,1}([0-9]{1,2})\\\"","gi");
 var re22_ = "$1°$2′$3″";

// градусы с секундами  23°8'
 var re23 = new RegExp("([0-9]{1,2})°\\\s{0,1}([0-9]{1,2})'","gi");
 var re23_ = "$1°$2′";

// удаление сдвоенных открывающих эмфазисов
 var re24 = new RegExp("<EM><EM>","gi");
 var re24_ = "<EM>"

// удаление сдвоенных закрывающих эмфазисов
 var re25 = new RegExp("</EM></EM>","gi");
 var re25_ = "</EM>"

// пропущенный пробел перед тире после букв
 var re26 = new RegExp("([A-zА-яЁё\\\)»:])("+fIB+"){0,1}:("+aIB+"){0,1}—(\\\s|"+nbspEntity+"){0,1}","gi");
 var re26_ = "$1$2 — ";
 var count_26 = 0;

// пропущенный пробел после двоеточия вслед за буквами (почему-то не реагирует на обычные двойные кавычки (\\\")?)
 var re27 = new RegExp("([A-zА-яЁё»])("+aIB+"){0,1}:("+aIB+"){0,1}([A-zА-яЁё„\\\"][^_\\\d])","gi");
 var re27_ = "$1$2: $3$4";

// точка в начале строки
 var re28 = new RegExp("^\\\.(\\\s|"+nbspEntity+"){0,1}([\\\wА-яЁё«\\\"„\\\(\\\?!…])","gi");
 var re28_ = "$2";

// тире вместо дефиса после точки перед Прописной
 var re29 = new RegExp("(\\\.)("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}\\\-("+aIB+"){0,1}(\\\s|"+nbspEntity+")("+sIB+"){0,1}([«„\\\"“]{0,1}[А-ЯЁ])","g");
 var re29_ = "$1$2$4"+nbspChar+"— $5$7$8";
 var count_29 = 0;


// удаление точки/запятой после запятой/точки между строчными
 var re31= new RegExp("([^\\\.][^"+nbspChar+"][А-яЁё»\\\)])("+aIB+"){0,1}([,\\\.])("+aIB+"){0,1}([\\\.,]){0,1}([a-zа-яё][^\\\.])","g");
 var re31_ = "$1$2$4$3 $6";

// удаление точки/запятой после запятой/точки между строчными
// var re31a= new RegExp("([^\\\.][^"+nbspChar+"][а-яё»\\\)])("+aIB+"){0,1}([,\\\.])("+aIB+"){0,1}([\\\.,]){0,1}([A-zА-яЁё][^\\\.])","g");
  var re31a= new RegExp("([^\\\.][^"+nbspChar+"][а-яё»\\\)])("+aIB+"){0,1}([,\\\.])("+aIB+"){0,1}([\\\.,]){0,1}([А-яЁё][^\\\.])","g");  // Отключил A-z, потому что ловится квадратная скобка "]"! Отмена неразрывного пробела не срабатывает.
 var re31a_ = "$1$2$4$3 $6";

// пробел после закрывающих кавычек перед буквами (почему-то не реагирует на обычные двойные кавычки (")?)
 var re32= new RegExp('([a-zа-яё])([\\\?!]){0,1}('+fIB+'){0,1}(»|“|\\\")('+aIB+'){0,1}([a-zа-яё])','gi');
 var re32_ = "$1$2$3$4 $5$6";

// странные закрывающие кавычки
 var re33= new RegExp("``","g");
 var re33_ = "»";

// пробел перед открывающимися кавычками
 var re34= new RegExp("([А-яЁёA-z:,\\\.])«([А-яЁёA-z])","g");
 var re34_ = "$1 «$2";

// пробел перед Прописной после строчной с точкой!?
 var re35= new RegExp("([а-яё])([\\\.\\\?!])("+aIB+"){0,1}([А-ЯЁA-Z])","g");
 var re35_ = "$1$2$3 $4";

// кавычки в начале строки
 var re36= new RegExp("^("+sIB+"){0,1}(.){0,1}»","g");
 var re36_ = "$1«";

// кавычки в конце строки
// var re37= new RegExp("«(.){0,1}("+aIB+"){0,1}$","g");
// var re37_ = "»$1";

// открывающие кавычки после двоеточия
// var re38= new RegExp(": ("+sIB+"){0,1}»","g");
// var re38_ = ": $1«";

// две точки после слова — в многоточие
 var re39= new RegExp("([а-яё])\\\.\\\. ","gi");
 var re39_ = "$1… ";


// квадратное окавычивание порядкового номера в ссылке сноски                       // отключаю касательство к сноскам
// var re40 = new RegExp("(<A class=note href=\\\"[^>]+\\\d{1,4}\\\">)[\\\[{]{0,1}[a-zа-я_\\\-]{0,10}(\\\s|"+nbspEntity+"){0,1}(\\\d{1,4})[\\\]}]{0,1}(</A>)","gi");
// var re40_ = "$1[$3]$4";

// снятие курсива со сноски                       // отключаю касательство к сноскам
// var re41 = new RegExp("(<A class=note href=\\\"[^>]+\\\d{1,4}\\\">[^><]+?</A>)("+fIB+")","gi");
// var re41_ = "$2$1";

// снятие курсива со сноски
// var re42 = new RegExp("("+sIB+")([\\\.\\\s]{0,2}<A class=note [^<]+?</A>)","gi");
// var re42_ = "$2$1";

// удаление пробела после [сноски] , если за пробелом следует препинание                       // отключаю касательство к сноскам
// var re43 = new RegExp("(\\\s|"+nbspEntity+"){0,1}(<A class=note [^<]+?</A>)(\\\s|"+nbspEntity+"){0,1}(([\\\.,;])|([!\\\?:…])){0,1}(\\\s|"+nbspEntity+"){0,1}("+fIB+"){0,1}","gi");
// var re43_ = "$8$4$2$7";
// var re43a_ = "$8 $6$2$5$7";

// удаление пробела перед [сноской]
 var re44 = new RegExp("(\\\s|"+nbspEntity+"){0,1}("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}(<A class=note [^<]+?</A>)","gi");
 var re44_ = "$2$4";

// удаление одного пробела вокруг </emphasis'а>
 var re45 = new RegExp("(\\\s|"+nbspEntity+")("+aIB+")(\\\s|"+nbspEntity+")","gi");
 var re45_ = "$1$2";

// препинания после [сноски] {в конце строки} везде
// var re46 = new RegExp("(<A class=note [^<]+?</A>)([\\\.!\\\?,:;]+("+fIB+"){0,1})","gi");
// var re46_ = "$2$1";

 // препинания после [сноски] в конце строки
// var re46a = new RegExp("(<A class=note href=\\\"[^>]+\\\d{1,4}\\\">[^><]+?</A>)([…]("+fIB+"){0,1})$","gi");
// var re46a_ = "$2$1";

// вставка пробела после [сноски] —                        // отключаю касательство к сноскам
// var re47 = new RegExp("(<A class=note [^<]+?</A>)("+sIB+"){0,1}([А-яЁёA-z\\\-–—\\\(\\\[])","gi");
// var re47_ = "$1 $2$3";
// var count_47 = 0;

 // удаление одного пробела вокруг <emphasis'а>
 var re48 = new RegExp("(\\\s|"+nbspEntity+")("+sIB+")(\\\s|"+nbspEntity+")","gi");
 var re48_ = "$2$3";

// снятие курсива со сноски
// var re49 = new RegExp("(<A class=note href=\\\"[^>]+\\\d{1,4}\\\">)("+sIB+")([^><]+?)("+fIB+")(</A>)","gi");
// var re49_ = "$1$3$5";



// пронумерованный/литерный список
 var re50 = new RegExp("^(("+sIB+"){0,1}[«\\\"]{0,1}(\\\d{1,3}|[a-zа-я])[\\\.\\\)]("+aIB+"){0,1})[\\\s| ]{0,1}(("+sIB+"){0,1}[А-яA-z—…\\\"«])","g");
 var re50_ = "$1"+nbspChar+"$5";
 var count_50 = 0;

// пронумерованный список: Ст. 15
 var re50a = new RegExp("^(("+sIB+"){0,1}([«\\\"]){0,1}(Ст)\\\.)(\\\s|"+nbspEntity+"){0,1}(\\\d{1,4})\\\.\\\s","g");
 var re50a_ = "$1"+nbspChar+"$6."+nbspChar;

// пронумерованный список: •
 var re50b = new RegExp("^("+sIB+"){0,1}(•)\\\s","g");
 var re50b_ = "$1$2"+nbspChar;

// перечень страниц и т.п. через запятую
 var re51 = new RegExp("(с|р|т|v|p)\\\.(\\\s|"+nbspEntity+"){0,1}(\\\d{1,4}),(\\\d{1,4})","gi");
 var re51_ = "$1."+nbspChar+"$3, $4";
 var count_51 = 0;

// перечень страниц и т.п. с интевалом
 var re52 = new RegExp(" (с|р|т|v|p)\\\.(\\\s|"+nbspEntity+"){0,1}(\\\d{1,4})-(\\\d{1,4})","gi");
 var re52_ = " $1."+nbspChar+"$3–$4";

// размерности
 var re53 = new RegExp("([^\\\-][IVX\\\d])(\\\s{0,1})("+sIB+"){0,1}(([ч|м|г|т|%])|(кг|см|км|гг|вв|в\\\.|мг|мл|вт|га)|(тыс|млн|час|мин|сек|чел|мкг|квт|руб|коп|экз)|(ккал|град|млрд))(\\\.{0,1})([^а-я\\\w])","g");
 var re53_ = "$1"+nbspChar+"$3$4$9$10";
 var count_53 = 0;

 // отбивка на полугегельную от цифр (неразрывный пробел) знаков параграфа, номера
 var re54 = new RegExp("([№§]) {0,1}(\\\d)","gi");
// var re54_ = "$1 $2";                                                 // "правильный" узкий пробел, отображется малым кол-вом шрифтов
 var re54_ = "$1"+nbspChar+"$2";                                                     // неразрывный пробел

// длинное тире после препинаний
 var re55 = new RegExp("([a-zа-яё\\\"“»\\\)\\\? ])("+aIB+"){0,1}([,!\\\?…\\\.\\\"]+)("+aIB+"){0,1}\\\s{0,1}—{1,2}(\\\s|"+nbspEntity+"){0,1}(.[^.])","gi");
 var re55_ = "$1$2$3$4"+nbspChar+"— $6";
 var count_55 = 0;

// длинное тире после препинаний и неразрывного пробела
 var re55a = new RegExp("([a-zа-яё\\\"“»\\\)\\\? ])("+aIB+"){0,1}([,!\\\?…\\\.]+)("+aIB+"){0,1}("+nbspEntity+")—{1,2}(.[^.])","gi");
 var re55a_ = "$1$2$3$4"+nbspChar+"— $6";

// длинное тире после букв и неразрывного пробела
 var re55b = new RegExp("([a-zа-яё\\\"“»])("+aIB+"){0,1}("+nbspEntity+")—{1,2}(.[^.])","gi");
 var re55b_ = "$1$2 — $4";

// удаление стыков эмфазиса
 var re56 = new RegExp("</EM>((\\\s|"+nbspEntity+"){0,1}[–—\\\.,;:!\\\?]{0,1}(\\\s|"+nbspEntity+"){0,1})<EM>","gi");
 var re56_ = "$1";

// тире вместо дефиса после точки перед открывающимися угловыми кавычками
 var re57 = new RegExp("(\\\.)(\\\s|"+nbspEntity+"){0,1}\\\-("+aIB+"){0,1}(\\\s|"+nbspEntity+"){0,1}("+sIB+"){0,1}([«„\\\"])","g");
 var re57_ = "$1$3"+nbspChar+"— $5$6";

// пропущенный пробел после тире после букв и перед буквами
 var re58 = new RegExp("([A-zА-яЁё\\\)\\\"»])("+fIB+"){0,1}(\\\s|"+nbspEntity+")("+fIB+"){0,1}—("+fIB+"){0,1}("+sIB+"){0,1}([A-zА-яЁё\\\(«])","gi");
 var re58_ = "$1$2$4 — $5$6$7";

// пропущенные пробелы вокруг тире между буквами                                              NEW
 var re59 = new RegExp("([A-zА-яЁё\\\)\\\"»])—([A-zА-яЁё\\\(«])","gi");
 var re59_ = "$1 — $2";

//  последовательность чисел
// var re59 = new RegExp("([123]{0,1}[3-8][257]\\\]{0,1}</a>)(\\\.|,|;) ","gi");
// var re59_ = '$1<a href="http://reeed.ru/">$2</a> ';

// интервал дат !!! Остались стрёмные моменты с длинным набором чисел, вроде почтового индекса или серийного номера
 var re60 = new RegExp("([^\\\-0-9№N\\\wА-я\\\)\\\/])(\\\d{4})(\\\s|"+nbspEntity+"){0,1}[-–—]{1,2}(\\\s|"+nbspEntity+"){0,1}(\\\d{4})([^a-zа-я0-9\\\-])","gi");
 var re60_ = "$1$2–$5$6";
// var count_60 = 0;

// интервал дат в отдельной строке
 var re60a = new RegExp("^(\\\d{4})(\\\s|"+nbspEntity+"){0,1}[-–—]{1,2}(\\\s|"+nbspEntity+"){0,1}(\\\d{4})","gi");
 var re60a_ = "$1–$4";

// интервал дат в начале абзаца
 var re61 = new RegExp("^(\\\d{4})(\\\s|"+nbspEntity+"){0,1}[-–—]{1,2}(\\\s|"+nbspEntity+"){0,1}(\\\d{4})([^a-zа-я0-9\\\-])","gi");
 var re61_ = "$1–$4$5";

// интервал дат
 var re62 = new RegExp("([^\\\-0-9№N\\\wА-я\\\)\\\/])(\\\d{3})(\\\s|"+nbspEntity+"){0,1}[-–—]{1,2}(\\\s|"+nbspEntity+"){0,1}(\\\d{3})([^a-zа-я0-9\\\-])","gi");
 var re62_ = "$1$2–$5$6"; 

// интервал дат
 var re63 = new RegExp("([^\\\-0-9№N\\\wА-я\\\)\\\/])(\\\d{2})(\\\s|"+nbspEntity+"){0,1}[-–—]{1,2}(\\\s|"+nbspEntity+"){0,1}(\\\d{2})([^a-zа-я0-9\\\-])","gi");
 var re63_ = "$1$2–$5$6"; 

// интервал дат
 var re64 = new RegExp("([^\\\-0-9№N\\\wА-я\\\)\\\/])(\\\d)(\\\s|"+nbspEntity+"){0,1}[-–—]{1,2}(\\\s|"+nbspEntity+"){0,1}(\\\d)([^a-zа-я0-9\\\-])","gi");
 var re64_ = "$1$2–$5$6"; 

//  знак градуса
 var re65 = new RegExp("(\\\d{1,2})([oо])(\\\d{1,2})","g");
 var re65_ = "$1°$3";

//  знак K°
// var re66 = new RegExp("([и&])(\\\s|"+nbspEntity+"){0,1}([KК])([oо°])([^A-zА-яЁё])","g");
// var re66_ = "$1 K°$5";

//  градус Цельсия
 var re67 = new RegExp("(\\\d)(\\\s|"+nbspEntity+"){0,1}[oо0°](\\\s){0,1}[CС]([^A-zА-яЁё]){0,1}","g");
 var re67_ = "$1"+nbspChar+"°C$4";

//  даты по-римски
 var re68 = new RegExp("([IVXLC])(\\\s|"+nbspEntity+"){0,1}[\\\-–—](\\\s|"+nbspEntity+"){0,1}([IVXLC])","g");
 var re68_ = "$1–$4";

//  знак №
 var re69 = new RegExp("N[oо°](\\\s|"+nbspEntity+"){0,1}(\\\d+)","g");
 var re69_ = "№"+nbspChar+"$2";

//  Рисунок №1
 var re70 = new RegExp("(рис)\\\.\\\s{0,1}(\\\d+)","gi");
 var re70_ = "$1."+nbspChar+"$2";

//  десятичные дроби
// var re71 = new RegExp("(,|;)(<A class=note href=\\\"[^>]+\\\d{1,4}\\\">\\\[{0,1}[3579][48]\\\]{0,1}</A> )","gi");
// var re71_ = '<a href="http://reeed.ru/">$1</a>$2';

// лишние пробелы (везде, кроме стихов и кода)
 var re80 = new RegExp("(\\\s|"+nbspEntity+"){2,}","g");
 var re80_ = "$1";
// var count_80 = 0;

// удаление конечных пробелов строки
 var re81 = new RegExp("(\\\s|"+nbspEntity+")+("+aIB+"){0,1}$","gi");
 var re81_ = "";
 var count_81 = 0;

// удаление начальных пробелов строки, кроме стихов
 var re82 = new RegExp("^("+sIB+"){0,1}(\\\s|"+nbspEntity+")+","gi");
 var re82_ = "$1";
 var count_82 = 0;

// удаление мягкого переноса
 var re83 = new RegExp("(­|&shy;)","gi");
 var re83_ = "";
 var count_83 = 0;

// удаление лишних конечных точек в заголовках
 var re84 = new RegExp("\\\.("+fIB+"){0,1}$","g");
 var re84ex = new RegExp("(([0-9](\\\s|"+nbspEntity+")г{1,2})|([IVX](\\\s|"+nbspEntity+")в{1,2})|(\\\-мл)|([?!]\\\.?))\\\.("+fIB+"){0,1}$","g");
 var re84_ = "";
 var count_84 = 0;

 // пропущенный пробел перед строчной после строчной и запятой, точки с запятой ({1,} - было 3 знака, TaKir)
 var re85= new RegExp("([а-яё0-9])([,;])([а-яё]{1,})","g");
 var re85_ = "$1$2 $3";

 // неверный знак препинания
 var re86= new RegExp("!…","g");
 var re86_ = "!..";

 // неверный знак препинания
// var re87= new RegExp("…[\\\.,]([^\\\.,])","g");
// var re87_ = "…$1";

// удаление ненужных идентификаторов после конвертации: AutBody_0DocRoot, …fb1, …ole_link2, …toc3, …0prim, …Q__4_Q и т.п.
 var re90 = new RegExp("AutBody_.+?","g");
 var count_90 = 0;

// удаление мусора.
 var re91= new RegExp("■","g");
 var re91_ = "";

 var re91a= new RegExp("\\\.;\\\.$","g");
 var re91a_ = ".";

 var re91b= new RegExp("^([^•]+)•","g");
 var re91b_ = "$1";

 var re91c= new RegExp("■","g");
 var re91c_ = "";
 
 // удаление невидимых знаков мягкого переноса U+00AD (TaKir)
 var re92 = new RegExp("(­)","gi");
 var re92_ = "";
 var count_92 = 0;
 
  // удаление Вставка справа-налево U+202B (TaKir)
 var re93 = new RegExp("(‫)","gi");
 var re93_ = "";
 var count_93 = 0;

  // замена неправильных апострофов на знак U+0027 (TaKir)
 var re94 = new RegExp("([´ʼ′˙΄’‘])","gi");
 var re94_ = "'";
 var count_94 = 0;
 
   // замена Область частного использования U+E088 (TaKir)
 var re95 = new RegExp("([])","gi");
 var re95_ = " ";
 var count_95 = 0;
 
    // замена сдвоенных обычных пробелов U+0020 (TaKir)
 var re96 = new RegExp("([\\u0020][\\u0020])","gi");
 var re96_ = " ";
 var count_96 = 0;
  
    // замена En пробелов U+2002 (TaKir)
 var re97 = new RegExp("([\\u2002])","gi");
 var re97_ = " ";
 var count_97 = 0;
 
     // удаление Пробелов нулевой ширины U+200B (TaKir)
 var re98 = new RegExp("([\\u200B])","gi");
 var re98_ = "";
 var count_98 = 0;

   // прилипшее многоточие (Sclex)
 var re99= new RegExp("([A-zА-яЁё](</?(EM|STRONG)>)*)…((</?(EM|STRONG)>)*[A-zА-яЁё])","gi");
 var re99_ = "$1… $4";
 var count_99 = 0;
 
    //  var re100 - Пробел перед маркером сноски

    // замена неправильных амперсандов (TaKir)
 var re101 = new RegExp("( amp; )","gi");
 var re101_ = " & ";
 var count_101 = 0;
 
   // замена мягких переносов U+00AD (TaKir)
 var re102 = new RegExp("([\\u00AD])","gi");
 var re102_ = "";
 var count_102 = 0;
 
    // замена остаточных мягких переносов (TaKir)
 var re103 = new RegExp("(&amp;shy;)","gi");
 var re103_ = "";
 var count_103 = 0;
 
     // замена Узких неразрывных пробелов U+202F на обычные неразрывные пробелы U+00A0 (TaKir)
 var re104 = new RegExp("([\\u202F])","gi");
 var re104_ = ""+nbspChar+"";
 var count_104 = 0;
 
      // расформатирование кривых ссылок-сносок, где маркер сноски - текст (буквы) без скобок, а текст сноски - web адрес этап № 1 (TaKir)
 var re105 = new RegExp("(<[aA]\\s[^>]*#http[^>]*>)((<\\w*>)*[^<>]*(</[^aA]\\w*>)*)(</[aA]>)","gi");             //   A -> А, a -> а
 var re105_ = " $2";
 var count_105 = 0;
  
      // расформатирование кривых ссылок-сносок, где маркер сноски - текст (буквы) без скобок, а текст сноски - web адрес этап № 2 (TaKir)
 var re106 = new RegExp("(<[aA]\\s[^>]*class=note[^>]*>)((<\\w*>)*[^\\[({<>]*(</[^aA]\\w*>)*)(</[aA]>)","gi");             //   A -> А, a -> а
 var re106_ = " $2";
 var count_106 = 0;
 
 // удаление лишнего пробела после расформатирования кривых ссылок (TaKir)
 var re107 = new RegExp("([\\u25AB])(\\s)","g");
 var re107_ = " ";
 var count_107 = 0;
  
 // удаление знака Разделительный параграф U+2029 (TaKir)
 var re108 = new RegExp("([\\u2029])","gi");
 var re108_ = "";
 var count_108 = 0;
 
    // замена Тонких пробелов U+2009 на обычные (TaKir)
 var re109 = new RegExp("([\\u2009])","gi");
 var re109_ = " ";
 var count_109 = 0;
 
     // замена Самых тонких пробелов U+200A на обычные (TaKir)
 var re110 = new RegExp("([\\u200A])","gi");
 var re110_ = " ";
 var count_110 = 0;
 
      // замена Три в em пробел U+2004 на обычные пробелы (TaKir)
 var re111 = new RegExp("([\\u2004])","gi");
 var re111_ = " ";
 var count_111 = 0;
 
       // замена Четыре в em пробел U+2005 на обычные пробелы (TaKir)
 var re112 = new RegExp("([\\u2005])","gi");
 var re112_ = " ";
 var count_112 = 0;
 
        // замена Шесть в em пробел U+2006 на обычные пробелы (TaKir)
 var re113 = new RegExp("([\\u2006])","gi");
 var re113_ = " ";
 var count_113 = 0; 
 
        // удаление служебных знаков U+E06E (TaKir)
 var re114 = new RegExp("([\\uE06E])","gi");
 var re114_ = "";
 var count_114 = 0;
 
         // удаление знаков "Пространство пунктуации" U+2008 (TaKir)
 var re115 = new RegExp("([\\u2008])","gi");
 var re115_ = "";
 var count_115 = 0;
 
          // маленький белый квадрат+дефис меняем на него же + тире (TaKir)
 var re116 = new RegExp("(▫-)","gi");
 var re116_ = "▫—";
 var count_116 = 0;
 
           // белый квадрат+дефис меняем на него же + тире (TaKir)
 var re117 = new RegExp("(□-)","gi");
 var re117_ = "□—";
 var count_117 = 0;
 
            // прозрачный маркер списка+дефис меняем на него же + тире (TaKir)
 var re118 = new RegExp("(◦-)","gi");
 var re118_ = "◦—";
 var count_118 = 0;
 
          // удаление знаков "Разделительная линия" U+2028 (TaKir)
 var re119 = new RegExp("([\\u2028])","gi");
 var re119_ = "";
 var count_119 = 0;
 
           // замена знаков "Граница легкая горизонтальная" U+2500 на тире (TaKir)
 var re120 = new RegExp("([\\u2500])","gi");
 var re120_ = "—";
 var count_120 = 0;
  
           // исправление многоточия после знаков препинания (TaKir)
 var re121 = new RegExp("([\\!\\?,:;])([…])","gi");
 var re121_ = "$1..";
 var count_121 = 0;
 
            // исправление троеточия после знаков препинания (TaKir)
 var re122 = new RegExp("([\\!\\?,:;])([\\.]{3})","gi");
 var re122_ = "$1..";
 var count_122 = 0;

            // удаление знаков "Символ заменяющий объект" ￼ U+FFFC (TaKir)
 var re123 = new RegExp("([\\uFFFC])","gi");
 var re123_ = "";
 var count_123 = 0;

            // удаление знаков "Метка слева-направо" U+200E (TaKir)
 var re124 = new RegExp("([\\u200E])","gi");
 var re124_ = "";
 var count_124 = 0;

            // замена знаков "Дефис" U+2010 на обычный дефис-минус (TaKir)
 var re125 = new RegExp("([\\u2010])","gi");
 var re125_ = "-";
 var count_125 = 0;

            // замена знаков "Горизонтальная линия" U+2015 на длинное тире (TaKir)
 var re126 = new RegExp("([\\u2015])","gi");
 var re126_ = "—";
 var count_126 = 0;

            // Удаление сдвоенных открывающих болдов (TaKir)
 var re127 = new RegExp("<STRONG><STRONG>","gi");
 var re127_ = "<STRONG>"
 var count_127 = 0;

            // Удаление сдвоенных закрывающих болдов (TaKir)
 var re128 = new RegExp("</STRONG></STRONG>","gi");
 var re128_ = "</STRONG>"
 var count_128 = 0;

            // Унификация открывающих болдов и курсивов (TaKir)
 var re129 = new RegExp("<EM><STRONG>","gi");
 var re129_ = "<STRONG><EM>"
 var count_129 = 0;

            // Унификация закрывающих болдов и курсивов (TaKir)
 var re130 = new RegExp("</EM></STRONG>","gi");
 var re130_ = "</STRONG></EM>"
 var count_130 = 0;

        // удаление символов "Соединитель слов" U+2060 (TaKir)
 var re131 = new RegExp("([\\u2060])","gi");
 var re131_ = "";
 var count_131 = 0;

        // замена Em пробел U+2003 на обычные пробелы (TaKir)
 var re132 = new RegExp("([\\u2003])","gi");
 var re132_ = " ";
 var count_132 = 0;

        // замена Цифровой пробел U+2007 на обычные пробелы (TaKir)
 var re133 = new RegExp("([\\u2007])","gi");
 var re133_ = " ";
 var count_133 = 0;

        // замена En квадрат U+2000 на обычные пробелы (TaKir)
 var re134 = new RegExp("([\\u2000])","gi");
 var re134_ = " ";
 var count_134 = 0;

        // замена Em квадрат U+2001 на обычные пробелы (TaKir)
 var re135 = new RegExp("([\\u2001])","gi");
 var re135_ = " ";
 var count_135 = 0;

        // замена "Узкий неразрывный пробел U+202F" на обычный неразрывный пробел (TaKir)
 var re136 = new RegExp("([\\u202F])","gi");
 var re136_ = ""+nbspChar+"";
 var count_136 = 0;

        // удаление символов "Неразрывный пробел нулевой ширины (BOM)" U+FEFF (TaKir)
 var re137 = new RegExp("([\\uFEFF])","gi");
 var re137_ = "";
 var count_137 = 0;

        // удаление символов "Нулевая ширина (без объединения)" U+200C (TaKir)
 var re138 = new RegExp("([\\u200C])","gi");
 var re138_ = "";
 var count_138 = 0;

        // удаление символов "Нулевая ширина (с объединением)" U+200D (TaKir)
 var re139 = new RegExp("([\\u200D])","gi");
 var re139_ = "";
 var count_139 = 0;

        // замена символов "Неразрывный дефис U+2011" на обычный дефис (TaKir)
 var re140 = new RegExp("([\\u2011])","gi");
 var re140_ = "-";
 var count_140 = 0;

        // удаление символов "Комбинируемая подстрочная точка" U+0323 (TaKir)
 var re141 = new RegExp("([\\u0323])","gi");
 var re141_ = "";
 var count_141 = 0;

   // замена Область частного использования U+F04A (TaKir)
 var re142 = new RegExp("([\\uF04A])","gi");
 var re142_ = " ";
 var count_142 = 0;

   // замена и + Комбинируемое бреве (и+U+0306) на й (TaKir)
 var re143 = new RegExp("(й)","gi");
 var re143_ = "й";
 var count_143 = 0;

   // замена Кольцо сверху U+02DA на градусы Цельсия (TaKir)
 var re144 = new RegExp("([\\u02DA])","gi");
 var re144_ = "°";
 var count_144 = 0;

   // замена Комбинируемый надстрочный кружок U+030A на градусы Цельсия (TaKir)
 var re145 = new RegExp("([\\u030A])","gi");
 var re145_ = "°";
 var count_145 = 0;

   // замена Мужской порядковый индикатор U+00BA на градусы Цельсия (TaKir)
 var re146 = new RegExp("([\\u00BA])","gi");
 var re146_ = "°";
 var count_146 = 0;

   // замена Надстрочный нуль U+2070 на градусы Цельсия (TaKir)
 var re147 = new RegExp("([\\u2070])","gi");
 var re147_ = "°";
 var count_147 = 0;

   // замена Латинская строчная буква кра "ĸ" U+0138 на русскую к (TaKir)
 var re148 = new RegExp("([\\u0138])","gi");
 var re148_ = "к";
 var count_148 = 0;

   // замена Латинская строчная буква e с диэризисом "ë" U+00EB на русскую ё (TaKir)
 var re149 = new RegExp("([\\u00EB])","gi");
 var re149_ = "ё";
 var count_149 = 0;



//~~~~~~~~~~~~~~ Конец шаблонов ~~~~~~~~~~~~~~~~~~


 var id;
 var s="";

 // функция, обрабатывающая абзац P
 function HandleP(ptr) {

       if (ptr.getAttribute("id").search(re90)>=0) { ptr.removeAttribute("id"); count_90++; } 


  s=ptr.innerHTML;

       if (s.search(re01)!=-1)         { s=s.replace(re01, re01_); count_01++}
       if (s.search(re30)!=-1)         { s=s.replace(re30, re30_); count_30++}
       if (s.search(re86)!=-1)         { s=s.replace(re86, re86_); }
  //   if (s.search(re87)!=-1)         { s=s.replace(re87, re87_); }

       if (s.search(re02)!=-1)         { s=s.replace(re02, re02_); }
       if (s.search(re03)!=-1)         { s=s.replace(re03, re03_); count_03++}
       if (s.search(re04)!=-1)         { s=s.replace(re04, re04_); count_04++}
       if (s.search(re05)!=-1)         { s=s.replace(re05, re05_); }
  //   if (s.search(re06)!=-1)         { s=s.replace(re06, re06_); count_06++}
       if (s.search(re07)!=-1)         { s=s.replace(re07, re07_); }
       if (s.search(re08)!=-1)         { s=s.replace(re08, re08_); count_08++}
       if (s.search(re09)!=-1)         { s=s.replace(re09, re09_); count_09++}
       if (s.search(re09a)!=-1)         { s=s.replace(re09a, re09a_); count_09++}

       if (s.search(re10)!=-1)         { s=s.replace(re10, re10_); count_10++}
       if (s.search(re11)!=-1)         { s=s.replace(re11, re11_); count_11++}
       if (s.search(re12)!=-1)         { s=s.replace(re12, re12_); }
       if (s.search(re13)!=-1)         { s=s.replace(re13, re13_); count_13++}
       if (s.search(re13a)!=-1)       { s=s.replace(re13a, re13a_); }
       if (s.search(re13b)!=-1)       { s=s.replace(re13b, re13b_); }
       if (s.search(re13c)!=-1)       { s=s.replace(re13c, re13c_); }
	   if (s.search(re14)!=-1)         { s=s.replace(re14, re14_); count_14++}
       if (s.search(re14a)!=-1)       { s=s.replace(re14a, re14a_); count_14++}
       if (s.search(re14b)!=-1)       { s=s.replace(re14b, re14b_); count_14++}
       if (s.search(re14c)!=-1)       { s=s.replace(re14c, re14c_); }
//       if (s.search(re15)!=-1)         { s=s.replace(re15, re15_); }
       if (s.search(re16)!=-1)         { s=s.replace(re16, re16_); }
//       if (s.search(re17)!=-1)         { s=s.replace(re17, re17_); }
//       if (s.search(re18)!=-1)         { s=s.replace(re18, re18_); }
       if (s.search(re19)!=-1 && ptr.parentNode.className=="stanza")         { s=s.replace(re19, re19_); }

       if (s.search(re20)!=-1)         { s=s.replace(re20, re20_); }
       if (s.search(re21)!=-1)         { s=s.replace(re21, re21_); }
       if (s.search(re22)!=-1)         { s=s.replace(re22, re22_); }
       if (s.search(re23)!=-1)         { s=s.replace(re23, re23_); }
       if (s.search(re24)!=-1)         { s=s.replace(re24, re24_); }
       if (s.search(re25)!=-1)         { s=s.replace(re25, re25_); }
       if (s.search(re26)!=-1)         { s=s.replace(re26, re26_); count_26++}
       if (s.search(re27)!=-1)         { s=s.replace(re27, re27_); count_26++}
       if (s.search(re28)!=-1)         { s=s.replace(re28, re28_); }
       if (s.search(re29)!=-1)         { s=s.replace(re29, re29_); count_29++}

       if (s.search(re31)!=-1)         { s=s.replace(re31, re31_); }
       if (s.search(re31a)!=-1)         { s=s.replace(re31a, re31a_); }
       if (s.search(re32)!=-1)         { s=s.replace(re32, re32_); count_26++}
       if (s.search(re33)!=-1)         { s=s.replace(re33, re33_); }
       if (s.search(re34)!=-1)         { s=s.replace(re34, re34_); }
       if (s.search(re35)!=-1)         { s=s.replace(re35, re35_); }
       if (s.search(re36)!=-1)         { s=s.replace(re36, re36_); }
//       if (s.search(re37)!=-1)         { s=s.replace(re37, re37_); }
//       if (s.search(re38)!=-1)         { s=s.replace(re38, re38_); }
       if (s.search(re39)!=-1)         { s=s.replace(re39, re39_); }

//       if (s.search(re40)!=-1 && Snoska)         { s=s.replace(re40, re40_); }                       // отключаю касательство к сноскам
//       if (s.search(re41)!=-1)         { s=s.replace(re41, re41_); }                                        // отключаю касательство к сноскам
//       if (s.search(re42)!=-1)         { s=s.replace(re42, re42_); }
//       if (s.search(re43)!=-1 && Snoska)         { s=s.replace(re43, re43_); }                       // отключаю касательство к сноскам
//       if (s.search(re43)!=-1 && !Snoska)         { s=s.replace(re43, re43a_); }                    // отключаю касательство к сноскам
       if (s.search(re44)!=-1)         { s=s.replace(re44, re44_); }
       if (s.search(re45)!=-1)         { s=s.replace(re45, re45_); }
//       if (s.search(re46)!=-1 && Snoska)         { s=s.replace(re46, re46_); }
//       if (s.search(re46a)!=-1 && Snoska)       { s=s.replace(re46a, re46a_); }
//       if (s.search(re47)!=-1)         { s=s.replace(re47, re47_); count_47++}                       // отключаю касательство к сноскам
       if (s.search(re48)!=-1)         { s=s.replace(re48, re48_); }
//       if (s.search(re49)!=-1)         { s=s.replace(re49, re49_); }

       if (s.search(re50)!=-1)         { s=s.replace(re50, re50_); count_50++}
       if (s.search(re50a)!=-1)       { s=s.replace(re50a, re50a_); count_50++}
       if (s.search(re50b)!=-1)       { s=s.replace(re50b, re50b_); count_50++}
       if (s.search(re51)!=-1)         { s=s.replace(re51, re51_); count_51++}
       if (s.search(re52)!=-1)         { s=s.replace(re52, re52_); count_51++}
       if (s.search(re53)!=-1)         { s=s.replace(re53, re53_); count_53++}
       if (s.search(re54)!=-1)         { s=s.replace(re54, re54_); }
       if (s.search(re55)!=-1)         { s=s.replace(re55, re55_); count_55++}
       if (s.search(re55a)!=-1)       { s=s.replace(re55a, re55a_); }
       if (s.search(re55b)!=-1)       { s=s.replace(re55b, re55b_); }
       if (s.search(re56)!=-1)         { s=s.replace(re56, re56_); count_10++}
       if (s.search(re57)!=-1)         { s=s.replace(re57, re57_); count_55++}
       if (s.search(re58)!=-1)         { s=s.replace(re58, re58_); count_26++}
       if (s.search(re59)!=-1)         { s=s.replace(re59, re59_); }
       if (s.search(re60)!=-1)         { s=s.replace(re60, re60_); }
       if (s.search(re60a)!=-1)       { s=s.replace(re60a, re60a_); }
       if (s.search(re61)!=-1)         { s=s.replace(re61, re61_); }
       if (s.search(re62)!=-1)         { s=s.replace(re62, re62_); }
       if (s.search(re63)!=-1)         { s=s.replace(re63, re63_); }
       if (s.search(re64)!=-1)         { s=s.replace(re64, re64_); }
       if (s.search(re65)!=-1)         { s=s.replace(re65, re65_); }
//       if (s.search(re66)!=-1)         { s=s.replace(re66, re66_); }                        // и компания Ко
//       if (s.search(re67)!=-1)         { s=s.replace(re67, re67_); }
       if (s.search(re68)!=-1)         { s=s.replace(re68, re68_); }
       if (s.search(re69)!=-1)         { s=s.replace(re69, re69_); }
       if (s.search(re70)!=-1)         { s=s.replace(re70, re70_); }
//       if (s.search(re71)!=-1 && Snoska)         { s=s.replace(re71, re71_); }
       if (s.search(re80)!=-1 && ptr.parentNode.className!="code" && ptr.parentNode.className!="stanza")         { s=s.replace(re80, re80_);}
       if (s.search(re81)!=-1)         { s=s.replace(re81, re81_); count_81++}
       if (s.search(re82)!=-1 && ptr.parentNode.className!="stanza")         { s=s.replace(re82, re82_); count_82++}
       if (s.search(re83)!=-1)         { s=s.replace(re83, re83_); count_83++}
       if (s.search(re84)!=-1 && s.search(re84ex)==-1 && ptr.parentNode.className=="title")         { s=s.replace(re84, re84_); count_84++}
       if (s.search(re85)!=-1)         { s=s.replace(re85, re85_); count_26++}

       if (s.search(re91)!=-1)         { s=s.replace(re91, re91_); }
       if (s.search(re91a)!=-1)       { s=s.replace(re91a, re91a_); }
       if (s.search(re91b)!=-1)       { s=s.replace(re91b, re91b_); }
       if (s.search(re91c)!=-1)       { s=s.replace(re91c, re91c_); }
	   
       if (s.search(re92)!=-1)       { count_92+=s.match(re92).length;s=s.replace(re92, re92_); }
	   if (s.search(re93)!=-1)       { count_93+=s.match(re93).length;s=s.replace(re93, re93_); }
	   if (s.search(re94)!=-1)       { count_94+=s.match(re94).length;s=s.replace(re94, re94_); }
	   if (s.search(re95)!=-1)       { count_95+=s.match(re95).length;s=s.replace(re95, re95_); }
	   if (s.search(re96)!=-1)       { count_96+=s.match(re96).length;s=s.replace(re96, re96_); }
	   if (s.search(re97)!=-1)       { count_97+=s.match(re97).length;s=s.replace(re97, re97_); }
	   if (s.search(re98)!=-1)       { count_98+=s.match(re98).length;s=s.replace(re98, re98_); }
	   if (s.search(re99)!=-1)       { count_99+=s.match(re99).length;s=s.replace(re99, re99_); }
//       if (s.search(re100)!=-1)       { count_100+=s.match(re100).length;s=s.replace(re100, re100_); }
	   if (s.search(re101)!=-1)       { count_101+=s.match(re101).length;s=s.replace(re101, re101_); }
	   if (s.search(re102)!=-1)       { count_102+=s.match(re102).length;s=s.replace(re102, re102_); }
	   if (s.search(re103)!=-1)       { count_103+=s.match(re103).length;s=s.replace(re103, re103_); }
	   if (s.search(re104)!=-1)       { count_104+=s.match(re104).length;s=s.replace(re104, re104_); }
	   if (s.search(re105)!=-1)       { count_105+=s.match(re105).length;s=s.replace(re105, re105_); }
	   if (s.search(re106)!=-1)       { count_106+=s.match(re106).length;s=s.replace(re106, re106_); }
	   if (s.search(re107)!=-1)       { count_107+=s.match(re107).length;s=s.replace(re107, re107_); }
	   if (s.search(re108)!=-1)       { count_108+=s.match(re108).length;s=s.replace(re108, re108_); }
	   if (s.search(re109)!=-1)       { count_109+=s.match(re109).length;s=s.replace(re109, re109_); }
	   if (s.search(re110)!=-1)       { count_110+=s.match(re110).length;s=s.replace(re110, re110_); }
	   if (s.search(re111)!=-1)       { count_111+=s.match(re111).length;s=s.replace(re111, re111_); }
	   if (s.search(re112)!=-1)       { count_112+=s.match(re112).length;s=s.replace(re112, re112_); }
	   if (s.search(re113)!=-1)       { count_113+=s.match(re113).length;s=s.replace(re113, re113_); }
	   if (s.search(re114)!=-1)       { count_114+=s.match(re114).length;s=s.replace(re114, re114_); }
	   if (s.search(re115)!=-1)       { count_115+=s.match(re115).length;s=s.replace(re115, re115_); }
	   if (s.search(re116)!=-1)       { count_116+=s.match(re116).length;s=s.replace(re116, re116_); }
	   if (s.search(re117)!=-1)       { count_117+=s.match(re117).length;s=s.replace(re117, re117_); }
	   if (s.search(re118)!=-1)       { count_118+=s.match(re118).length;s=s.replace(re118, re118_); }
	   if (s.search(re119)!=-1)       { count_119+=s.match(re119).length;s=s.replace(re119, re119_); }
	   if (s.search(re120)!=-1)       { count_120+=s.match(re120).length;s=s.replace(re120, re120_); }
	   if (s.search(re121)!=-1)       { count_121+=s.match(re121).length;s=s.replace(re121, re121_); }
	   if (s.search(re122)!=-1)       { count_122+=s.match(re122).length;s=s.replace(re122, re122_); }
	   if (s.search(re123)!=-1)       { count_123+=s.match(re123).length;s=s.replace(re123, re123_); }
	   if (s.search(re124)!=-1)       { count_124+=s.match(re124).length;s=s.replace(re124, re124_); }
	   if (s.search(re125)!=-1)       { count_125+=s.match(re125).length;s=s.replace(re125, re125_); }
	   if (s.search(re126)!=-1)       { count_126+=s.match(re126).length;s=s.replace(re126, re126_); }
	   if (s.search(re127)!=-1)       { count_127+=s.match(re127).length;s=s.replace(re127, re127_); }
	   if (s.search(re128)!=-1)       { count_128+=s.match(re128).length;s=s.replace(re128, re128_); }
	   if (s.search(re129)!=-1)       { count_129+=s.match(re129).length;s=s.replace(re129, re129_); }
	   if (s.search(re130)!=-1)       { count_130+=s.match(re130).length;s=s.replace(re130, re130_); }
	   if (s.search(re131)!=-1)       { count_131+=s.match(re131).length;s=s.replace(re131, re131_); }
	   if (s.search(re132)!=-1)       { count_132+=s.match(re132).length;s=s.replace(re132, re132_); }
	   if (s.search(re133)!=-1)       { count_133+=s.match(re133).length;s=s.replace(re133, re133_); }
	   if (s.search(re134)!=-1)       { count_134+=s.match(re134).length;s=s.replace(re134, re134_); }
	   if (s.search(re135)!=-1)       { count_135+=s.match(re135).length;s=s.replace(re135, re135_); }
	   if (s.search(re136)!=-1)       { count_136+=s.match(re136).length;s=s.replace(re136, re136_); }
	   if (s.search(re137)!=-1)       { count_137+=s.match(re137).length;s=s.replace(re137, re137_); }
	   if (s.search(re138)!=-1)       { count_138+=s.match(re138).length;s=s.replace(re138, re138_); }
	   if (s.search(re139)!=-1)       { count_139+=s.match(re139).length;s=s.replace(re139, re139_); }
	   if (s.search(re140)!=-1)       { count_140+=s.match(re140).length;s=s.replace(re140, re140_); }
	   if (s.search(re141)!=-1)       { count_141+=s.match(re141).length;s=s.replace(re141, re141_); }
	   if (s.search(re142)!=-1)       { count_142+=s.match(re142).length;s=s.replace(re142, re142_); }
	   if (s.search(re143)!=-1)       { count_143+=s.match(re143).length;s=s.replace(re143, re143_); }
	   if (s.search(re144)!=-1)       { count_144+=s.match(re144).length;s=s.replace(re144, re144_); }
	   if (s.search(re145)!=-1)       { count_145+=s.match(re145).length;s=s.replace(re145, re145_); }
	   if (s.search(re146)!=-1)       { count_146+=s.match(re146).length;s=s.replace(re146, re146_); }
	   if (s.search(re147)!=-1)       { count_147+=s.match(re147).length;s=s.replace(re147, re147_); }
	   if (s.search(re148)!=-1)       { count_148+=s.match(re148).length;s=s.replace(re148, re148_); }
	   if (s.search(re149)!=-1)       { count_149+=s.match(re149).length;s=s.replace(re149, re149_); }











   


   ptr.innerHTML=s;      
  } 

    window.external.BeginUndoUnit(document,"«Генеральная уборка»");                               // ОТКАТ (UNDO) начало

 var body=document.getElementById("fbw_body");
 var ptr=body;
 var ProcessingEnding=false;
 while (!ProcessingEnding && ptr) {
  SaveNext=ptr;
  if (SaveNext.firstChild!=null && SaveNext.nodeName!="P" && 
      !(SaveNext.nodeName=="DIV" && 
        ((SaveNext.className=="history" && !ObrabotkaHistory) || 
         (SaveNext.className=="annotation" && !ObrabotkaAnnotation))))
  {    SaveNext=SaveNext.firstChild; }                                                         // либо углубляемся...

  else {
    while (SaveNext.nextSibling==null)  {
     SaveNext=SaveNext.parentNode;                                                           // ...либо поднимаемся (если уже сходили вглубь)
                                                                                                                // поднявшись до элемента P, не забудем поменять флаг
     if (SaveNext==body) {ProcessingEnding=true;}
                                                         }
   SaveNext=SaveNext.nextSibling; //и переходим на соседний элемент
         }
  if (ptr.nodeName=="P") HandleP(ptr);
  ptr=SaveNext;
 }

    window.external.EndUndoUnit(document);                                             // undo конец

var Tf=new Date().getTime();
var Thour = Math.floor((Tf-Ts)/3600000);
var Tmin  = Math.floor((Tf-Ts)/60000-Thour*60);
var Tsec = Math.ceil((Tf-Ts)/1000-Tmin*60-Thour*3600);
var Tsec1 = Math.ceil(10*((Tf-Ts)/1000-Tmin*60))/10;
var Tsec2 = Math.ceil(100*((Tf-Ts)/1000-Tmin*60))/100;
var Tsec3 = Math.ceil(1000*((Tf-Ts)/1000-Tmin*60))/1000;

           if (Tsec3<1 && Tmin<1)    TimeStr=Tsec3+ " сек"
 else { if (Tsec2<10 && Tmin<1)   TimeStr=Tsec2+ " сек"
 else { if (Tsec1<30 && Tmin<1)   TimeStr=Tsec1+ " сек"
 else { if (Tmin<1)                       TimeStr=Tsec+ " сек" 
 else { if (Tmin>=1 && Thour<1)   TimeStr=Tmin+ " мин " +Tsec+ " с"
 else { if (Thour>=1)                    TimeStr=Thour+ " ч " +Tmin+ " мин " +Tsec+ " с" }}}}}

// вывод статистики, если она, конечно, есть
 var st2="";

// без тире в диалогах 08 и дублей пробелов 80
 if (count_01!=0 || count_03!=0 || count_04!=0 ||  count_09!=0  || count_10!=0 || count_11!=0 || count_13!=0 || count_14!=0 || count_26!=0 || count_29!=0 || count_30!=0 || count_50!=0 || count_51!=0 || count_53!=0 || count_55!=0 || count_81!=0 || count_82!=0 || count_84!=0 || count_90!=0 || count_121!=0 || count_122!=0)   {st2+='\n Статистика'}


 if (count_01!=0)   {st2+='\n• Неразрывный пробел на обычный:	'+count_01;}
 if (count_03!=0)   {st2+='\n• Пробел перед закрывающими:	'+count_03;}
 if (count_04!=0)   {st2+='\n• Пробел после открывающих:	'+count_04;}

// if (count_06!=0)   {st2+='\n• Троеточие на многоточие:		'+count_06;}
// if (count_08!=0)   {st2+='\n• Лидирующее тире в диалогах:	'+count_08;}

 if (count_09!=0)   {st2+='\n• Курсивные знаки препинания:	'+count_09;}
 if (count_10!=0)   {st2+='\n• Стык эмфазисов:            	 	'+count_10;}
 if (count_11!=0)   {st2+='\n• Так далее и т.п.:             		'+count_11;}
 if (count_13!=0)   {st2+='\n• Дефис после знаков препинания:	'+count_13;}
 if (count_14!=0)   {st2+='\n• Замена дефисов на тире:   	'+count_14;}
 if (count_26!=0)   {st2+='\n• Пропущенный пробел :  		'+count_26;}
 if (count_29!=0)   {st2+='\n• Тире вместо дефиса после точки: 	'+count_29;}
 if (count_30!=0)   {st2+='\n• Точки в строчных после пробела:	'+count_30;}

// if (count_44!=0)   {st2+='\n• Пробел перед маркером сноски:  	'+count_44;}
// if (count_47!=0)   {st2+='\n• Пробел после сноски:  		'+count_47;}                       // отключаю касательство к сноскам

 if (count_50!=0)   {st2+='\n• Пронумерованный список:  	'+count_50;}
 if (count_51!=0)   {st2+='\n• Номера страниц:    		'+count_51;}
 if (count_53!=0)   {st2+='\n• Размерности:     			'+count_53;}
 if (count_55!=0)   {st2+='\n• Тире после препинаний:  		'+count_55;}

// if (count_60!=0)   {st2+='\n• Интервал дат:  			'+count_60;}
// if (count_80!=0)   {st2+='\n• Дублированные пробелы:   	'+count_80;}

 if (count_81!=0)   {st2+='\n• Конечный пробел параграфа: 	'+count_81;}
 if (count_82!=0)   {st2+='\n• Начальный пробел абзаца:   	'+count_82;}
 if (count_83!=0)   {st2+='\n• Мягкие переносы "в чистом виде":      		'+count_83;}
 if (count_84!=0)   {st2+='\n• Конечные точки в заголовках: 	'+count_84;}
 if (count_90!=0)   {st2+='\n• Лишние идентификаторы:  	'+count_90;}
 if (count_92!=0)   {st2+='\n• Знаки мягкого переноса U+00AD:  	'+count_92;}
 if (count_93!=0)   {st2+='\n• Вставка справа-налево U+202B:  	'+count_93;}
 if (count_94!=0)   {st2+='\n• Некорректные апострофы:  	'+count_94;}
 if (count_95!=0)   {st2+='\n• Область частного использования U+E088:  	'+count_95;}
 if (count_96!=0)   {st2+='\n• Сдвоенные пробелы U+0020:  	'+count_96;}
 if (count_97!=0)   {st2+='\n• En пробелы U+2002:  	'+count_97;}
 if (count_98!=0)   {st2+='\n• Пробел нулевой ширины U+200B:  	'+count_98;}
 if (count_99!=0)   {st2+='\n• Прилипшее многоточие:  	'+count_99;}

// if (count_100!=0)   {st2+='\n• Пробел перед маркером сноски:  	'+count_100;}

 if (count_101!=0)   {st2+='\n• Амперсанды &:  	'+count_101;}
 if (count_102!=0)   {st2+='\n• Мягкий перенос U+00AD:  	'+count_102;}
 if (count_103!=0)   {st2+='\n• Остаточный мягкий перенос shy:  	'+count_103;}
 if (count_104!=0)   {st2+='\n• Узкий неразрывный пробел:  	'+count_104;}
 if (count_105!=0)   {st2+='\n• Кривые ссылки-сноски-1:  	'+count_105;}
 if (count_106!=0)   {st2+='\n• Кривые ссылки-сноски-2:  	'+count_106;}
 if (count_107!=0)   {st2+='\n• Лишние пробелы после удаления ссылок:  	'+count_107;}
 if (count_108!=0)   {st2+='\n• Разделительный параграф U+2029:  	'+count_108;}
 if (count_109!=0)   {st2+='\n• Тонкие пробелы U+2009:  	'+count_109;}
 if (count_110!=0)   {st2+='\n• Самые тонкие пробелы U+200A:  	'+count_110;}
 if (count_111!=0)   {st2+='\n• Три в em пробел U+2004:  	'+count_111;}
 if (count_112!=0)   {st2+='\n• Четыре в em пробел U+2005:  	'+count_112;}
 if (count_113!=0)   {st2+='\n• Шесть в em пробел U+2006:	'+count_113;}
 if (count_114!=0)   {st2+='\n• Служебные знаки U+E06E:	'+count_114;}
 if (count_115!=0)   {st2+='\n• Пространство пунктуации U+2008:	'+count_115;}
 if (count_116!=0)   {st2+='\n• Маленький белый квадрат+дефис:	'+count_116;}
 if (count_117!=0)   {st2+='\n• Белый квадрат+дефис:	'+count_117;}
 if (count_118!=0)   {st2+='\n• Прозрачный маркер списка+дефис:	'+count_118;}
 if (count_119!=0)   {st2+='\n• Разделительная линия U+2028:	'+count_119;}
 if (count_120!=0)   {st2+='\n• Граница легкая горизонтальная U+2500:	'+count_120;}
 if (count_121!=0)   {st2+='\n• Исправление многоточия после препинаний:	'+count_121;}
 if (count_122!=0)   {st2+='\n• Исправление троеточия после препинаний:	'+count_122;}
 if (count_123!=0)   {st2+='\n• Символ, заменяющий объект ￼:	'+count_123;}
 if (count_124!=0)   {st2+='\n• Метка слева-направо U+200E:	'+count_124;}
 if (count_125!=0)   {st2+='\n• Замена дефисов U+2010:	'+count_125;}
 if (count_126!=0)   {st2+='\n• Горизонтальные линии U+2015:	'+count_126;}
 if (count_127!=0)   {st2+='\n• Сдвоенные открывающие болды:	'+count_127;}
 if (count_128!=0)   {st2+='\n• Сдвоенные закрывающие болды:	'+count_128;}
 if (count_129!=0)   {st2+='\n• Унификация открывающих болдов и курсивов:	'+count_129;}
 if (count_130!=0)   {st2+='\n• Унификация закрывающих болдов и курсивов:	'+count_130;}
 if (count_131!=0)   {st2+='\n• Соединитель слов U+2060:	'+count_131;}
 if (count_132!=0)   {st2+='\n• Em пробел U+2003:	'+count_132;}
 if (count_133!=0)   {st2+='\n• Цифровой пробел U+2007:	'+count_133;}
 if (count_134!=0)   {st2+='\n• En квадрат U+2000:	'+count_134;}
 if (count_135!=0)   {st2+='\n• Em квадрат U+2001:	'+count_135;}
 if (count_136!=0)   {st2+='\n• Узкий неразрывный пробел U+202F:	'+count_136;}
 if (count_137!=0)   {st2+='\n• Неразрывный пробел нулевой ширины (BOM) U+FEFF:	'+count_137;}
 if (count_138!=0)   {st2+='\n• Нулевая ширина (без объединения) U+200C:	'+count_138;}
 if (count_139!=0)   {st2+='\n• Нулевая ширина (с объединением) U+200D:	'+count_139;}
 if (count_140!=0)   {st2+='\n• Неразрывный дефис U+2011:	'+count_140;}
 if (count_141!=0)   {st2+='\n• Комбинируемая подстрочная точка U+0323:	'+count_141;}
 if (count_142!=0)   {st2+='\n• Область частного использования U+F04A:	'+count_142;}
 if (count_143!=0)   {st2+='\n• Комбинируемое бреве+и на й:	'+count_143;}
 if (count_144!=0)   {st2+='\n• Кольцо сверху на градусы:	'+count_144;}
 if (count_145!=0)   {st2+='\n• Надстрочный кружок на градусы:	'+count_145;}
 if (count_146!=0)   {st2+='\n• Мужской порядковый индикатор на градусы:	'+count_146;}
 if (count_147!=0)   {st2+='\n• Надстрочный нуль на градусы:	'+count_147;}
 if (count_148!=0)   {st2+='\n• Латинская строчная буква кра на к:	'+count_148;}
 if (count_149!=0)   {st2+='\n• Латинская строчная буква e с диэризисом на ё:	'+count_149;}

 

 if (st2!="") st2="\n"+st2;

 MsgBox ('                  –= Jurgen Script =– \n'+
        ' «Генеральная уборка» v.'+VersionNumber+' Golma+TaKir Edition 2025       \n\n'+

        ' Время: ' +TimeStr+'.'+st2); 


} 